Repository: hbotond1999/Datafyme
Catalog: backend/reportassistant/locale/*/LC_MESSAGES/django.po
Languages: hu

source: Type your message...
hu: Kezdjen el írni

source: Choose a source
hu: Válasszon adatforrást

source: Generating description...
hu: Leírás generálása...

source: HUMAN
hu: Ember

source: You
hu: Te

source: System
hu: Rendszer

source: download
hu: A táblázat csak előnézet, teljes letöltése

source: Chat History
hu: Chat történet

source: Continue Conversation
hu: Beszélgetés folytatása

source: Start New Conversation
hu: Új beszélgetés kezdése

source: Add Dashboard
hu: Dashboard hozzáadása

source: Title
hu: Cím

source: required
hu: Kötelező

source: Close
hu: Bezárás

source: Save
hu: Mentés

source: DATABASE_LOADED_SUCCESSFULLY
hu: Az adatbázis betöltése sikeres

source: ERROR_TO_LOAD_DATABASE
hu: Váratlan hiba történ a betöltés során

source: Add new database
hu: Új adatbázis felvétele

source: Name
hu: Név

source: Display name
hu: Megjelenítendő név

source: Type
hu: Típus

source: Username
hu: Felhasználónév

source: Access group
hu: Hozzáférő csoport

source: Status
hu: Státusz

source: Actions
hu: Műveletek

source: Paused
hu: Felfügesztett

source: LOADING
hu: Feldolgozás

source: READY
hu: Kész

source: ERROR
hu: Hiba

source: Select a type
hu: Válasszon típust

source: Database name
hu: Adatbázis neve

source: Password
hu: Jelszó

source: Save Connection
hu: Kapcsolat mentése

source: Could not connect to database
hu: Nem lehet csatlakozni az adatbázishoz

source: SUCCESS
hu: Sikeres

source: WARNING
hu: Veszély

source: CRITICAL
hu: Hiba

source: Start Chat
hu: Chat kezdése

source: Chat history
hu: Chat történet

source: DB connections
hu: Adatbázis kapcsolatok

source: LLM models
hu: LLM modellek

source: Logout
hu: Kilépés

source: English
hu: Angol

source: Hungarian
hu: Magyar

source: API Key
hu: API kulcs

source: Inactive
hu: Inaktív

source: Warning: This is an active model. After deletion, there will be no active GenAI model until you set up a new one.
hu: Figyelmeztetés: Ez egy aktív modell. Törlése után nem lesz aktív LLM modell, amíg nem állít be egy újat.

source: Cancel
hu: Mégsem

source: Confirm Deletion
hu: Törlés megerősítése

source: GenAI Models
hu: LLM modellek

source: New model
hu: Új modell

source: Provider
hu: Szolgáltató

source: Model name
hu: Modell neve

source: Edit
hu: Szekesztés

source: Delete
hu: Törlés

source: No GenAI models added yet. Click the "New model" button to create a new model.
hu: Nincs még LLM modell hozzáadva. Kattintson az "Új modell" gombra egy új modell létrehozásához

source: Create New GenAI Model
hu: Új LLM Modell Létrehozása

source: Edit GenAI Model
hu: LLM Modell Szerkesztése

source: Provider API key to fetch models
hu: A szolgáltató API kulcsa a modellek lekérdezéséhez

source: Fetch models
hu: Modellek lekérdezése

source: Fetch models first
hu: Először kérdezze le a modelleket

source: Active model
hu: Aktív modell

source: Only one model can be active. If checked, all other models will be made inactive.
hu: Csak egy modell lehet aktív. Ha bejelöli, az összes többi modell inaktív lesz.

source: Back
hu: Vissza

source: Please select a provider!
hu: Kérjük, válasszon szolgáltatót!

source: Please enter an API key!
hu: Kérjük, adja meg az API kulcsot!

source: Validating API key with \
hu: API kulcs validálása, "Hello World" teszttel...

source: Validating...
hu: Validálás...

source: Error testing API key
hu: Hiba a API kulcs tesztelésekor

source: Invalid API key or network error
hu: Érvénytelen API kulcs vagy hálózati hiba

source: Validate API key first
hu: Először validálja az API kulcsot

source: Checking if the message is relevant for a reporting tasks.
hu: Ellenőrzés, hogy az üzenet releváns-e jelentéskészítési feladatokhoz.

source: Is SQL needed?
hu: SQL szükséges?

source: New chart generation is needed?
hu: Új diagram generálás szükséges?

source: Summarize history
hu: Történet összefoglalása

source: Generating SQL query
hu: SQL lekérdezés generálása

source: Execute the generated SQL query
hu: A generált SQL lekérdezés végrehajtása

source: Refine SQL query
hu: SQL lekérdezés finomítása

source: Create visualization
hu: Vizualizáció létrehozása

source: Generating the answer
hu: Válasz generálása

source: Search for tables
hu: Táblák keresése

source: Getting table definitions
hu: Tábla definíciók lekérése

source: Ranking relevant tables
hu: Releváns táblák rangsorolása

source: Refining user question
hu: Felhasználói kérdés finomítása

source: Finding related tables
hu: Kapcsolódó táblák keresése

source: Getting final table definitions
hu: Végső tábla definíciók lekérése

source: Creating SQL query
hu: SQL lekérdezés létrehozása

source: Deciding representation type
hu: Megjelenítési típus döntése

source: Deciding chart type
hu: Diagram típus döntése

source: Populating chart data
hu: Diagram adatok feltöltése

source: Validating chart data
hu: Diagram adatok validálása

source: Creating final data
hu: Végső adatok létrehozása

source: progress
hu: folyamatban

source: Ready
hu: Kész
